12/data/attachments/d06c4113f8114001.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_30227e46-c1fd-41dc-9412-4d1f0c3bbc5f</nif:username>
            <nif:friendToBeAdded>Benjamin_your_Friend_78666_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>